Can't make footprint roof.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDrawProfileRoof { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDrawProfileRoof As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDrawProfileRoof {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace